src/main/resources/command.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mod="http://mas/aml/soap/model">
   <soapenv:Header/>
   <soapenv:Body>
      <mod:getCustomerFormCommandRequest>
         <!--Optional:-->
         <mod:individualTag>Y</mod:individualTag>
         <!--Optional:-->
         <mod:firstNameEn>Chrizzy</mod:firstNameEn>
         <!--Optional:-->
         <mod:middleNameEn>Poqui</mod:middleNameEn>
         <!--Optional:-->
         <mod:lastNameEn>Loco</mod:lastNameEn>
         <!--Optional:-->
         <mod:dateOfBirth>2001-03-17</mod:dateOfBirth>
         <!--Optional:-->
         <mod:placeOfBirth>PH</mod:placeOfBirth>
         <!--Optional:-->
         <mod:nationality>Filipino</mod:nationality>
         <!--Optional:-->
         <mod:contactNo>090101010101</mod:contactNo>
         <!--Optional:-->
         <mod:gender>F</mod:gender>
         <!--Optional:-->
         <mod:identificationType>sss</mod:identificationType>
         <!--Optional:-->
         <mod:identificationNo>112313213</mod:identificationNo>
         <!--Optional:-->
         <mod:resAddrRoom>1</mod:resAddrRoom>
         <!--Optional:-->
         <mod:resAddrFloor>1</mod:resAddrFloor>
         <!--Optional:-->
         <mod:resAddrBlock>28</mod:resAddrBlock>
         <!--Optional:-->
         <mod:resAddrLot>3</mod:resAddrLot>
         <!--Optional:-->
         <mod:resAddrBuildingName>null</mod:resAddrBuildingName>
         <!--Optional:-->
         <mod:resAddrStreet>PUD Site</mod:resAddrStreet>
         <!--Optional:-->
         <mod:resAddrVillage>Escopa</mod:resAddrVillage>
         <!--Optional:-->
         <mod:resAddrHousingProject>Project 4</mod:resAddrHousingProject>
         <!--Optional:-->
         <mod:resAddrDistrict>2</mod:resAddrDistrict>
         <!--Optional:-->
         <mod:resAddrCity>QC</mod:resAddrCity>
         <!--Optional:-->
         <mod:resAddrCountryCode>PH</mod:resAddrCountryCode>
         <!--Optional:-->
         <mod:companyNameEn>null</mod:companyNameEn>
         <!--Optional:-->
         <mod:companyType>null</mod:companyType>
         <!--Optional:-->
         <mod:companyTelNo>null</mod:companyTelNo>
         <!--Optional:-->
         <mod:companyPrimaryContactNo>null</mod:companyPrimaryContactNo>
         <!--Optional:-->
         <mod:companyDateOfIncorporation>null</mod:companyDateOfIncorporation>
         <!--Optional:-->
         <mod:companyCertificationType>null</mod:companyCertificationType>
         <!--Optional:-->
         <mod:companyCertificationNo>null</mod:companyCertificationNo>
         <!--Optional:-->
         <mod:companyRegistrationType>null</mod:companyRegistrationType>
         <!--Optional:-->
         <mod:companyRegistrationNo>null</mod:companyRegistrationNo>
         <!--Optional:-->
         <mod:comAddrRoom>null</mod:comAddrRoom>
         <!--Optional:-->
         <mod:comAddrFloor>null</mod:comAddrFloor>
         <!--Optional:-->
         <mod:comAddrBlock>null</mod:comAddrBlock>
         <!--Optional:-->
         <mod:comAddrLot>null</mod:comAddrLot>
         <!--Optional:-->
         <mod:comAddrBuildingName>null</mod:comAddrBuildingName>
         <!--Optional:-->
         <mod:comAddrStreet>null</mod:comAddrStreet>
         <!--Optional:-->
         <mod:comAddrVillage>null</mod:comAddrVillage>
         <!--Optional:-->
         <mod:comAddrHousingProject>null</mod:comAddrHousingProject>
         <!--Optional:-->
         <mod:comAddrDistrict>null</mod:comAddrDistrict>
         <!--Optional:-->
         <mod:comAddrCity>null</mod:comAddrCity>
         <!--Optional:-->
         <mod:comAddrCountryCode>null</mod:comAddrCountryCode>
         <!--Optional:-->
         <mod:countryCodeIncorporation>PH</mod:countryCodeIncorporation>
         <!--Optional:-->
         <mod:countryCodeOperation>PH</mod:countryCodeOperation>
         <!--Optional:-->
         <mod:authorizedSigners>Y</mod:authorizedSigners>
         <!--Optional:-->
         <mod:legal>Y</mod:legal>
         <!--Optional:-->
         <mod:management>Y</mod:management>
         <!--Optional:-->
         <mod:owner>Y</mod:owner>
         <!--Optional:-->
         <mod:regulatory>Y</mod:regulatory>
         <!--Optional:-->
         <mod:companySourceIncome>null</mod:companySourceIncome>
         <!--Optional:-->
         <mod:natureOfCompany>null</mod:natureOfCompany>
         <!--Optional:-->
         <mod:individualSourceIncome>STAFF</mod:individualSourceIncome>
         <!--Optional:-->
         <mod:natureOfIndividualSourceIncome>IT Industry</mod:natureOfIndividualSourceIncome>
         <!--Optional:-->
         <mod:role>STAFF</mod:role>
         <!--Optional:-->
         <mod:clientId>fa8c20e6-28e7-4dd0-a335-fd9e73a25950</mod:clientId>
         <!--Optional:-->
         <mod:clientAcctId>edaae4bd-ea0c-4e9b-a673-155591e19e62</mod:clientAcctId>
         <!--Optional:-->
         <mod:clientType>PERSON</mod:clientType>
      </mod:getCustomerFormCommandRequest>
   </soapenv:Body>
</soapenv:Envelope>